In [9]:
import os
import mysql.connector
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [4]:
connection=mysql.connector.connect(host='localhost',
                                  username='root',
                                  password='black123')

In [5]:
cursor=connection.cursor()
cursor.execute('show databases')
for i in cursor:
    print (i)

('cds10',)
('classicmodels',)
('information_schema',)
('mysql',)
('mysqlpractice',)
('mysqlpractice1',)
('performance_schema',)
('productorders',)
('sakila',)
('sm100',)
('sys',)

In [7]:
connection=mysql.connector.connect(host='localhost',
                                  username='root',
                                  password='black123',
                                  database='productorders')

In [10]:
tabels=pd.read_sql_query('show tables', connection)
print(tabels)

  Tables_in_productorders
0         customerdetails
1         employeesdetail
2            orderdetails

In [14]:
query="select * from customerdetails"
output=pd.read_sql_query(query,connection)
print(output)

   CustomerID Firstname  Lastname                Email        Address  \
0           1   Michael     Brown  michael@example.com    123 Main St
1           2      Emma   Johnson     emma@example.com     456 Elm St
2           3    Oliver     Smith   oliver@example.com     789 Oak St
3           4    Sophia  Williams   sophia@example.com  101 Maple Ave
4           5     James       Lee    james@example.com    222 Pine St

            City Country
0       New York     USA
1    Los Angeles     USA
2        Chicago     USA
3        Houston     USA
4  San Francisco     USA

In [15]:
query="select * from employeesdetail"
output=pd.read_sql_query(query,connection)
print(output)

   EmpID Firstname  Lastname       Dpart   Salary    HireDate
0      1      John       Doe          HR  50000.0  2020-01-15
1      2      Jane     Smith   Marketing  55000.0  2019-05-20
2      3      Mike   Johnson          IT  60000.0  2018-09-10
3      4     Emily  Williams     Finance  58000.0  2021-03-12
4      5     David       Lee  Operations  52000.0  2017-11-25

In [16]:
query="select * from orderdetails"
output=pd.read_sql_query(query,connection)
print(output)

   OrderID  CustomerID   OrderDate  TotalAmount  IsShipped
0        1           3  2023-07-01        100.0          1
1        2           1  2023-07-05        250.0          1
2        3           4  2023-07-10        180.0          0
3        4           2  2023-07-15        300.0          1
4        5           5  2023-07-20        120.0          1

In [22]:
# Retrieve the top 3 highest-paid employees.
query="select * from employeesdetail order by Salary desc limit 3"
output=pd.read_sql_query(query,connection)
print(output)

querys="select topp 3 * from employeesdetail order by salary desc"
outputs=pd.read_sql_query(query,connection)
print(outputs)

   EmpID Firstname  Lastname      Dpart   Salary    HireDate
0      3      Mike   Johnson         IT  60000.0  2018-09-10
1      4     Emily  Williams    Finance  58000.0  2021-03-12
2      2      Jane     Smith  Marketing  55000.0  2019-05-20
   EmpID Firstname  Lastname      Dpart   Salary    HireDate
0      3      Mike   Johnson         IT  60000.0  2018-09-10
1      4     Emily  Williams    Finance  58000.0  2021-03-12
2      2      Jane     Smith  Marketing  55000.0  2019-05-20

In [23]:
#  Find the customers who have placed orders.
query="select distinct C.CustomerID,C.Firstname,C.Lastname from customerdetails C inner join orderdetails O On O.CustomerID = C.CustomerID "
output=pd.read_sql_query(query,connection)
print(output)

   CustomerID Firstname  Lastname
0           3    Oliver     Smith
1           1   Michael     Brown
2           4    Sophia  Williams
3           2      Emma   Johnson
4           5     James       Lee

In [26]:
# Show employees and their department names in alphabetical order.
query="select * from employeesdetail order by Firstname asc"
output=pd.read_sql_query(query,connection)
print(output)

   EmpID Firstname  Lastname       Dpart   Salary    HireDate
0      5     David       Lee  Operations  52000.0  2017-11-25
1      4     Emily  Williams     Finance  58000.0  2021-03-12
2      2      Jane     Smith   Marketing  55000.0  2019-05-20
3      1      John       Doe          HR  50000.0  2020-01-15
4      3      Mike   Johnson          IT  60000.0  2018-09-10

In [27]:
# Display orders with the customer's first name and last name.
query="select C.Firstname, C.lastname from customerdetails C inner join Orderdetails O on C.CustomerID=O.CustomerID;"
output=pd.read_sql_query(query,connection)
print(output)

  Firstname  lastname
0    Oliver     Smith
1   Michael     Brown
2    Sophia  Williams
3      Emma   Johnson
4     James       Lee

In [34]:
# Retrieve employees hired in the year 2022.
query="select * from employeesdetail where year(hiredate)=2022;"
output=pd.read_sql_query(query,connection)
print(output)

Empty DataFrame
Columns: [EmpID, Firstname, Lastname, Dpart, Salary, HireDate]
Index: []

In [35]:
# Show customers who have placed orders on different dates.
query="SELECT DISTINCT customerdetails.* FROM customerdetails INNER JOIN orderdetails ON customerdetails.CustomerID = orderdetails.CustomerID GROUP BY customerdetails.CustomerID, FirstName, LastName HAVING COUNT(DISTINCT orderdetails.OrderDate) > 1;"
output=pd.read_sql_query(query,connection)
print(output)

Empty DataFrame
Columns: [CustomerID, Firstname, Lastname, Email, Address, City, Country]
Index: []

In [40]:
# Find the total number of orders placed by each customer.
query="SELECT C.CustomerID, C.FirstName, C.LastName, COUNT(O.OrderID) AS TotalOrders FROM Customerdetails C LEFT JOIN Orderdetails O ON C.CustomerID = O.CustomerID GROUP BY C.CustomerID, C.FirstName, C.LastName;"
output=pd.read_sql_query(query,connection)
print(output)

   CustomerID FirstName  LastName  TotalOrders
0           1   Michael     Brown            1
1           2      Emma   Johnson            1
2           3    Oliver     Smith            1
3           4    Sophia  Williams            1
4           5     James       Lee            1

In [39]:
# Retrieve employees who work in the IT department.
query="select * from employeesdetail where Dpart='IT';"
output=pd.read_sql_query(query,connection)
print(output)

   EmpID Firstname Lastname Dpart   Salary    HireDate
0      3      Mike  Johnson    IT  60000.0  2018-09-10

In [41]:
# Find the customers who have placed orders for more than once.
query="SELECT customerdetails.* FROM customerdetails INNER JOIN orderdetails ON customerdetails.CustomerID = orderdetails.CustomerID GROUP BY customerdetails.CustomerID, FirstName, LastName HAVING COUNT(orderdetails.OrderID) > 1;;"
output=pd.read_sql_query(query,connection)
print(output)

Empty DataFrame
Columns: [CustomerID, Firstname, Lastname, Email, Address, City, Country]
Index: []

In [44]:
query="select TOP 2* from employeesdetailorder by salary desc;"
output=pd.read_sql_query(query,connection)
print(output)

DatabaseError: Execution failed on sql 'select TOP 2* from employeesdetailorder by salary desc;': 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '2* from employeesdetailorder by salary desc' at line 1